{
    "games": [
        {
            "title": "Monster Survivors",
            "category": "action",
            "slug": "monster-survivors",
            "shortDescription": "An intense survival action game where you battle waves of monsters and evolve your character.",
            "fullDescription": "Monster Survivors is an action-packed survival game where you must fight against endless waves of monsters. Collect experience points to level up your character, unlock new abilities, and discover powerful weapons. The game features stunning graphics, challenging gameplay, and a progression system that keeps you coming back for more.",
            "thumbnail": "assets/images/games/action/monster-survivors.jpg",
            "iframeUrl": "https://example.com/games/monster-survivors",
            "features": [
                "Fast-paced action combat",
                "Character progression system",
                "Multiple weapon types",
                "Unique monster designs",
                "Dynamic difficulty scaling"
            ],
            "howToPlay": "Use WASD to move your character. Left-click to attack. Right-click to use special abilities. Collect power-ups to enhance your character's abilities.",
            "controls": {
                "WASD": "Movement",
                "Left Click": "Attack",
                "Right Click": "Special Ability",
                "Space": "Dodge",
                "E": "Interact"
            }
        },
        {
            "title": "Puzzle Master",
            "category": "puzzle",
            "slug": "puzzle-master",
            "shortDescription": "A challenging puzzle game that tests your problem-solving skills with increasingly difficult levels.",
            "fullDescription": "Puzzle Master is a brain-teasing puzzle game that will challenge your problem-solving abilities. With over 100 unique levels, each featuring different mechanics and challenges, you'll need to think strategically to progress. The game includes beautiful visuals, relaxing music, and a hint system to help when you're stuck.",
            "thumbnail": "assets/images/games/puzzle/puzzle-master.jpg",
            "iframeUrl": "https://example.com/games/puzzle-master",
            "features": [
                "100+ challenging levels",
                "Multiple puzzle types",
                "Hint system",
                "Progress tracking",
                "Achievement system"
            ],
            "howToPlay": "Click and drag objects to solve puzzles. Each level has unique mechanics and objectives. Use hints when you're stuck.",
            "controls": {
                "Mouse": "Click and drag objects",
                "Space": "Reset level",
                "H": "Show hint",
                "Esc": "Pause menu"
            }
        }
    ]
} 